#include <iostream>
using namespace std;

void KolElMemory();
void TablIst();
void KolVihSvyaz();
void DiagramaVeicha();

int main()
{
	setlocale(0,"");

	cout<<"Двоичный счетчик накапливающего типа на 8 внутренних состояний в базисе НЕ-И-ИЛИ и Т-триггер.\n\n";

	KolElMemory();

	TablIst();

	KolVihSvyaz();

	DiagramaVeicha();

	return 0;
}

void KolElMemory()
{
	cout<<"1. Определение кол-ва элементов памяти n:\n"
			"Формула: n >= log(b)l = log(2)8 = 3\n"
			"где: l - количество внутренних состояний ЦА,\n"
			"b – основание системы счисления (равной 2).\n\n";
}

void TablIst()
{
	cout<<"2. Определим количество входных аргументов для ЦА, содержащего 3 элемента памяти q1, q2 и q3:\n"
			"1-й аргумент - выходной сигнал 3-го триггера q3*;\n"
			"2-й аргумент - выходной сигнал 2-го триггера q2*;\n"
			"3-й аргумент - выходной сигнал 1-го триггера q1*;\n"
			"4-й аргумент – входной сигнал автомата – V.\n\n";

	cout<<"Таблица переходов двоичного 3-х разрядного суммирующего счетчика, построенная в виде таблицы истинности:\n";

	cout << "   ______________________________________________________________________________________________________________________" << endl;
	cout << "  |  q3* |   0  |   0  |   0  |   0  |   0  |   0  |   0  |   0  |   1  |   1  |   1  |   1  |   1  |   1  |   1  |   1  |" << endl;
	cout << "  |______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|" << endl;
	cout << "  |  q2* |   0  |   0  |   0  |   0  |   1  |   1  |   1  |   1  |   0  |   0  |   0  |   0  |   1  |   1  |   1  |   1  |" << endl;
	cout << "  |______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|" << endl;
	cout << "  |  q1* |   0  |   0  |   1  |   1  |   0  |   0  |   1  |   1  |   0  |   0  |   1  |   1  |   0  |   0  |   1  |   1  |" << endl;
	cout << "  |______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|" << endl;
	cout << "  |   V  |   0  |   1  |   0  |   1  |   0  |   1  |   0  |   1  |   0  |   1  |   0  |   1  |   0  |   1  |   0  |   1  |" << endl;
	cout << "  |______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|" << endl;
	cout << "  |  q3  |   0  |   0  |   0  |   0  |   0  |   0  |   0  |   1  |   1  |   1  |   1  |   1  |   1  |   1  |   1  |   0  |" << endl;
	cout << "  |______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|" << endl;
	cout << "  |  q2  |   0  |   0  |   0  |   1  |   1  |   1  |   1  |   0  |   0  |   0  |   0  |   1  |   1  |   1  |   1  |   0  |" << endl;
	cout << "  |______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|" << endl;
	cout << "  |  q1  |   0  |   1  |   1  |   0  |   0  |   1  |   1  |   0  |   0  |   1  |   1  |   0  |   0  |   1  |   1  |   0  |" << endl;
	cout << "  |______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|" << endl<<endl;

	cout<<"Таблица возбуждения:\n";

	cout << "   ______________________________________________________________________________________________________________________" << endl;
	cout << "  |  h3  |   0  |   0  |   0  |   0  |   0  |   0  |   0  |   1  |   0  |   0  |   0  |   0  |   0  |   0  |   0  |   1  |" << endl;
	cout << "  |______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|" << endl;
	cout << "  |  h2  |   0  |   0  |   0  |   1  |   0  |   0  |   0  |   1  |   0  |   0  |   0  |   1  |   0  |   0  |   0  |   1  |" << endl;
	cout << "  |______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|" << endl;
	cout << "  |  h1  |   0  |   1  |   0  |   1  |   0  |   1  |   0  |   1  |   0  |   1  |   0  |   1  |   0  |   1  |   0  |   1  |" << endl;
	cout << "  |______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|______|" << endl;

	cout<<endl;
}

void KolVihSvyaz()
{
	cout<<"3. Находим количество выходных связей (p), идущих на память:\n"
			"p=eэп * n = 3,\n"
			"где: eэп – количество входов у элементов памяти;\n"
			"n - количество элементов памяти.\n"
			"Следовательно, комбинационная схема имеет общее количество входов\n"
			"Wобщ= w+p=3, так как Т-триггер является автоматом Мура (w=0).\n\n";
}

void DiagramaVeicha()
{
	cout<<"4. Построим для каждой из функций возбуждения hi(q3*, q2*, q1*, v) диаграмму Вейча-Карно\n\n";

	cout << "h3(q3*,q2*,q1*,V):   " << endl;
	cout << endl;

	cout << "  |q3*q2*" << endl;
	cout << "  |___________________________" << endl;
	cout << "10|      |      |      |      |" << endl;
	cout << "  |______|______|______|______|" << endl;
	cout << "11|      |      |   1  |      |" << endl;
	cout << "  |______|______|______|______|" << endl;
	cout << "01|      |      |   1  |      |" << endl;
	cout << "  |______|______|______|______|" << endl;
	cout << "00|      |      |      |      |" << endl;
	cout << "  |______|______|______|______|______" << endl;
	cout << "      00     01     11     10    q1*V" << endl << endl;

	cout << "h2(q3*,q2*,q1*,V):   " << endl;
	cout << endl;

	cout << "  |q3*q2*" << endl;
	cout << "  |___________________________" << endl;
	cout << "10|      |      |   1  |      |" << endl;
	cout << "  |______|______|______|______|" << endl;
	cout << "11|      |      |   1  |      |" << endl;
	cout << "  |______|______|______|______|" << endl;
	cout << "01|      |      |   1  |      |" << endl;
	cout << "  |______|______|______|______|" << endl;
	cout << "00|      |      |   1  |      |" << endl;
	cout << "  |______|______|______|______|______" << endl;
	cout << "      00     01     11     10    q1*V" << endl << endl;

	cout << "h1(q3*,q2*,q1*,V):   " << endl;
	cout << "  |q3*q2*" << endl;
	cout << "  |___________________________" << endl;
	cout << "10|      |   1  |   1  |      |" << endl;
	cout << "  |______|______|______|______|" << endl;
	cout << "11|      |   1  |   1  |      |" << endl;
	cout << "  |______|______|______|______|" << endl;
	cout << "01|      |   1  |   1  |      |" << endl;
	cout << "  |______|______|______|______|" << endl;
	cout << "00|      |   1  |   1  |      |" << endl;
	cout << "  |______|______|______|______|______" << endl;
	cout << "      00     01     11     10    q1*V" << endl << endl;

	cout<<"Функции возбуждения в тупиковой ДНФ:\n";
	cout<<"h3= q2* q1* v\n";
	cout<<"h2= q1* v\n";
	cout<<"h1= v\n";
}
